<template>
    <div id="main_text">
            <div id="back_button" @click="myButtons"></div>
            <div id="next_button" @click="myButtons" ></div>
            <div id="next_chapter" @click="nextChapter" >לעבור לפרק הבא</div>
            <h3 id="inner_title">{{this.nameTitle}}</h3>
            <div id="study" v-if="choosen === 0"><p id="real_study_text">{{arrayOne[i][j]}}</p></div>
            <div id="study"  v-if="choosen === 1"><p id="real_study_text">{{arrayTwo[i][j]}}</p></div>
            <div id="study"  v-if="choosen === 2"><p id="real_study_text">{{arrayThree[i][j]}}</p></div>
            <div id="study"  v-if="choosen === 3"><p id="real_study_text">{{arrayFour[i][j]}}</p></div>
            <div id="study"  v-if="choosen === 4"><p id="real_study_text">{{arrayFive[i][j]}}</p></div>
    </div>
</template>


<script>
export default {
      name: "main-text",
      props: ['subjectsName', 'subNumber', 'innerPart', 'nameTitle'],
  data() {
    return {
        arrayOne: [['מפקדת החיל חונכת את הבה"ד באופן מקצועי תורתי, ונושאת באחריות בתחום ההדרכה במספר נושאים מוגדרים:' + '' +
        'כתיבת תפיסת הדרכה חיילית, כתיבת תו"ל לרבות ניתוחי תפקיד וכשירויות, אישור תיקי יסוד, הובלת הלמידה המבצעית, ייזום והקמת מאמנים, הטמעת אמל"ח בהכשרות, הנחיות מקצועיות שוטפות, אישור תכולות הדרכה, בקרת איכות ההכשרות בבה"ד וקבלת החלטות שוטפות עבור ההכשרות'],
         ['שעון פעילות הוא גרף המגדיר את העיתוי של מופעי ניהול ההדרכה המרכזיים בהכשרה. במסגרת ניהול ההדרכה ביחידת ההכשרה, מתקיימים מופעי הדרכה שתכליתם ניהול שגרת ההכשרות בצורה שיטתית ואיכותית. דוגמאות למופעי שעון הפעילות: אישור הכנות סגלים למחזור, אישור תוכניות לפתיחת הכשרה, פורומי הסמכות, ועדות הערכה לחניכים, הצגת סיכום הכשרה ותחקיר הכנות סגלים למחזור.' + ''], 
         ['מילון מושגים: ' + '' + "" + 'אבחון הדרכתי מלא - תהליך שיטתי וסדור של איסוף ומיפוי נתונים לצורך  איתור צרכי הדרכה. איתור צרכים ממוקד - תהליך סדור של איסוף נתונים ממוקד להכשרה אחת או לנושא אחד בהכשרה.  יבוצע כאשר מתגלה פער באבחון ההדרכתי. צורך הדרכתי - בעיה או פער בביצוע או בתהליך שפתרונו אפשרי על ידי התערבות הדרכתית. אבחון הדרכתי = איתור צרכים.' , 'הגדרות זמנים: ' + '' + "" + ' אחת לשנה יתבצע ביחידה איתור צרכים לכלל מסגרות היחידה. תוכנית האבחון תבוצע ברבעון ד’ של שנת העבודה הנוכחית, לקראת גיבוש ת”ע שנתית יחידתית. מסגרת הזמנים לביצוע האבחון היא רבעון לכל היותר מתחילת התהליך ועד הצגת התוצרים.', 'ניהול תהליך איתור צרכים: ' + '' + "" + 'תהליך האבחון ינוהל ע”י גוף פיתוח הדרכה ביחידה. טרם תחילת התהליך תיכתב פק”א המגדירה את שלבי התהליך, השותפים, לוחות הזמנים, השיטות והמקורות. פק”א זו תאושר ע”י מפקד בית הספר.',  'איסוף הנתונים: ' + '' + "" + ' תהליך האבחון כולל בחינת תהליכי ההדרכה ותוצרי הדרכה ע”פ 4 ממדי ההדרכה. את התהליך יש לבצע ע”פ מחוון קריטריונים למיפוי יחידת ההדרכה. במסגרת איסוף הנתונים יידגמו המסגרות ביחס של לפחות 1:2 בכל אחת מהמסגרות המכשירות ביחידה. ש לשלב כלים ושיטות מגוונות לאיסוף נתונים. המקורות לאיסוף הנתונים יהיו מגוונים עד כמה שינתן. לאחר תהליך איסוף הנתונים יש לבצע תהליך עיבוד אישי, סטטיסטי וקבוצתי.'], 
         ['תוכנית העבודה השנתית של יחידת ההדרכה מגובשת לאור הנחיות המפקד היחידה ומושפעת ממשתנים רבים ובניהם אבחון הדרכתי ליחידה (ראה נוהל 1.3 ) תוכנית עבודה יחידתית מאפשרת ליחידה להתמקד ולקדם מושאים לצד התפעול השוטף של היחידה. בתוכנית העבודה מביא המפקד לידי ביטוי את חזונו, מטרותיו וסדרי העדיפויות שלו. תוכנית העבודה ההדרכתית היא נגזרת מתוכנית העבודה השנתית של היחידה.', 'ניהול תוכנית העבודה:' + "  " + " " + 'לכל בה"ד תכתב תוכנית עבודה שנתית או דו-שנתית המאושרת על-ידי מפקד היחידה, לכל בה"ד תכתב תוכנית עבודה הדרכתית שנתית או דו-שנתית, הנגזרת, בין היתר, מתוכנית העבודה היחידתית, מתוכנית העבודה של המפקדה הממונה ומתהליך מיפוי צרכים. תוכנית העבודה ההדרכתית תגלם את כלל הפעולות לשיפור ההכשרות בהובלת גפ"ה היחידה. תוכנית העבודה ההדרכתית תכתב ע"י מפקדת הגפ"ה ותאושר אצל מפקד הבה"ד עד ל30.1 בכל שנה.', 'תוכן תוכנית העבודה:' + "" + "  " + 'תוכנית העבודה ההדרכתית תהיה מחולקת למשימות על-פי ממדי ההדרכה  ותגלם את הפעולות ההדרכתיות המחייבות הבאות: אבחון הדרכתי, הערכת הכשרות, פיתוח/רה- פיתוח הכשרות ותיקוף תיקי יסוד, פיתוח תכולות ושיטות הדרכה, הטמעת אמל"ח ומאמנים, מופעי למידה ומופעי הטמעת תו תקן להכשרות.', 'תוכנית העבודה תכלול את העמודות הבאות: הממד, המשימה, אבני הדרך, שותפים ועיתוי ותאריך גמר ביצוע. כלל דיוני הסטאטוס והנחיות מפקד מאישור תוכנית העבודה וכן מדיוני הסטאטוס יתועדו וישמרו לכל הפחות שנתיים. תוכניות העבודה ההדרכתיות ישמרו לכל הפחות 4 שנים. תוכניות העבודה ההדרכתיות וכן סיכומי דיוני הסטאטוס ישמרו ויונגשו לכלל סגלי פיתוח ההדרכה ואוכלוסיית המג"דים בבה"ד באחריות מפקד גוף פיתוח ההדרכה ביחידה.'], 
         ['ביצוע תהליך סדור של אישורי תוכניות למחזור, וסיכום מחזור הכשרה ע”י מפקד ביה”ס. זהו תהליך המסכם את מחזור ההכשרה בכלל ההיביטים- הדרכתיים, לוגיסטיים וכו’. הגדרות: תקופת הדרכה-  פרק זמן מוגדר של הדרכה שנעשית בקורס מסויים. מחזור קורס או הכשרה- מופע מוגדר של קורס עם תאריך פתיחה וסיום. סדרה בתוך הכשרה- לבנת תוכן בתוך הכשרה.', 'שלושת הדיונים המרכזיים בנושא זה אשר ייערכו בראשות המפקד: סיכום מחזור הכשרה. אישורי תוכניות להכנת הסגל ו”כברת דרך”. אישור תוכניות למחזור וכשירות הסגל.',
            'סיכום מחזור ההכשרה כולל שלושה דגשים עיקריים: מידת העמידה במטרות ההכשרה, חוזקות וחולשות בכשירות המבצעית של בוגרי ההכשרה, פערי הסמכות- כשירויות שלא הוגשו עבור כל החניכים או חלקם. קורסי הקצונה- יבוצע ויוצג תחקיר אשר נושאו יאושר ע”י מ’ ביה”ס ויוצג למפקד זרוע היבשה במופע סיום קק”ץ בבה”ד 1. יתר הקורסים- יש להציג תחקיר בנושא שיאושר ע”י הרע”ן או המג”ד.',
            'דגשים ותיעוד ניהול ידע- -כלל סיכומי ההכשרה- מצגות, דו”חות וסיכומי הדיונים, יתועדו ויונגשו לכלל המפקדים מדרג המ”פ.   -המידע יישמר לשנתיים לפחות. -בקרה על התהליך, התיעוד וההנגשה, באחריות הגדודים באתר בהל”ג.'], 
         ['סיכומים עיתיים במהלך הקורס הם מנגנונים שמאפשרים מעקב ובקרה אחר מימוש תוכנית ההכשרה,  וכן אחר התקדמות החניכים בתהליך הלמידה, לצורך קבלת החלטות בזמן רלוונונטי בסוגיות שונות. סיכומים עיתיים מהווים גם תחקירי אמצע הממוקדים לפרקי ההכשרה.', 'ישנם חמישה סוגים של סיכומים עיתיים: סיכום יומי, סיכום שבועי, סיכומים לשבועות עצימים, סיכום אמצע מחזור, סטאטוס הסמכות. תיעוד וניהול הידע, הסיכומים ישמרו ויונגשו לפרק זמן של שנתיים. אחריות התיעוד וניהול הידע הוא באחריות קה"ד הגדוד ובבקרה של מפקד הגפ"ה.'], 
         ['השנה בבהל”ג, יתקיים משוב שטח על מגמת חי”ר גבולות ואיסוף קרבי!. הגדרות: הערכת הדרכה-  תהליך איסוף נתונים ועיבודם לצורך קבלת החלטות. הערכת אפקטיביות ההדרכה- תהליך הבודק את תרומת ההדרכה להשגת המטרות, היעדים, ביצועים ותפוקות המתקבלים מתוכנית פעילות או מערכת.', 'מטרת הערכת תוכנית ההכשרה (אפקטיביות ההדרכה) היא קבלת החלטות לגבי שינויים ושיפורים בתוכנית ההכשרה ובתהליכי ההדרכה. הערכה בודקת היא הכשרה ממוקדת אחת, במטרה לאתר פערים לשיפור- בתוכנית ההכשרה, בסגל המפקדים ובסביבת ההדרכה.', 'במידה ועולה פער בהשגת כשירות מסויימת יש להעמיק בתחקור בנושא, על מנת לגבש המצעות לייעול ושיפור ההכשרה. הנתונים שנאספו ייבדקו לכדי חוזקות, חולשות, מגמות מרכזיות וכאמור בחתך כשירויות.'], 
         ['ביקורות הדרכה משמשות לבחינת מידת היישום של תו התקן לאיכות ההכשרות במסגרות הבה”ד השונות. הגדרות: מבדק נהלים - מבדק שמטרתו להעריך את מידת היישום של נוהלי מפקד בהל”ג במסגרות ביה”ס. סוגי המבדקים - מבדק פנימי - נערך ע”י היחידה ומטרתו לאתר את הפערים ביישום הנהלים בבה”ד ולאפשר ליחידה לתקן פערים אלה. מבדק חיצוני - נערך ע”י צוות חוץ בה”די, ומציג למפקד הבה”ד ולפורום הבכיר את ממצאי הבדיקה.', 'ביקורת חיצונית - ביקורת המבוצעת ע”י גורם זרועי/מטכ”לי, במתכונת מתואמת/’פתע’/’פתע פתע’. מטרתה לוודא מימוש הנחיות ופקודות זרועיות ו/או מטכ”ליות. סוקר - קצין או חייל שהוכשר לבצע מבדקים פנימיים וחיצוניים. ', ' עקרונות לביצוע: ביקורות בבה”ד יבוצעו לפחות אחת לתקה”ד (בכל תחום). אחריות ביצוע הבקרות הן של קציני המטה של ביה”ס, כל אחד בתחומו. הביקורות יבוצעו ע”פ פורמט בקרה מטעם מה”י או הזרוע. על פורמט זה ניתן להוסיף נושאים נוספים לשיקול מפקד ביה”ס. כל בקרה תכלול את המרכיבים הבאים בכל מסגרת: עיון בחומרים כתובים ומערכות ממוחשבות.   שיחה עם מ”פ. שיחת חתך סגל. שיחת חתך חניכים. ממצאי הביקורות יוצגו למפקד המסגרת הנבדקת ולמפקד ביה”ס בדיון ייעודי לנושא.', 'כלל הפורמטים לביקורת הדרכה יונגשו באתר בהל”ג באחריות מוביל הביקורת בבה”ד.'],
         ['קיום מנגנונים איכותיים לניהול מידע, יאפשרו לבה”ד להיות ארגון לומד. מקובל להבחין בין שלושה  סוגי מידע המנוהלים בהכשרות- 1. מידע על הפרט- החניך והמקד. 2. מידע לימודי לקיום ההכשרה להכשרה ספציפית. 3. מידע ארגוני- פריטי מידע המשמשים לניהול הכשרה ספציפית ,  או בנושאים רוחביים', 'שלוש פלטפורמות עיקריות לניהול ידע בבהל״ג: 1 .אתר בהל”ג האזרחי- אתר המרכז תוצרי למידה בלמסים. 2 .אתר בהל״ג הצבאי- המרכז סיכומי מחזור ומסמכי יסוד. 3. קמפוס דיגטלי- קמפוס דיגיטלי היא תוכנה שמשמשת מערכת מכוונת להוראה או למידה משולבת מחשב. מערכת הקמפוס הדיגטלי משמשת לניהול קורסים וכוללת בדיקת מבחנים, הגשת עבודות, הצנת ציונים נוכחות ועוד.'],
         ['הקמפוס הדיגיטלי היא מערכת לניהול ההדרכה והלמידה, תומכת בתהליכי למידה בהכשרות, באימונים ומשמשת לניהול כשירות הפרט.' + '' + "" + 'עקרונות העבודה: ' + '' + "" + 'תהליכי ההדרכה הבאים ינוהלו בקמפוס הדיגיטלי: ניהול קורסי אב תואמים לתיקי היסוד, ניהול מחזורי ההכשרה ע"פ קורס האב, תיק חניך - (תיעוד מלא של נתוני הלומד בהכשרה לרבות מבחנים, משובים ודפי הערכה. ), תיק לאיש סגל - (תיעוד מלא של נתוני איש הסגל לרבות מבחני כשירות, משובים ודפי הערכה.). ', 'ועדות הסמכה בהכשרה, תיעוד סטטוס, סיום קורס הקורס של החניך וציון סוף הקורס, ביצוע העברת מקל וקליטת חייל מההכשרה בשטח ע"ב נתוני המערכת, ניהול כשירות הסגל, "כשיר להכשיר" ו"כברת הדרך" ע"ג הקמפוס הדיגיטלי. בע"ת להטמעת הקמפוס הדיגיטלי: מוביל ההטמעה בבית הספר הוא מפקד הגפ"ה ביחידה. בכל תקה"ד כלל הסגל יעבור השתלמות בבהל"ג ע"י נאמן המערכת על מנת להבטיח יעול מקסימלי של המערכת ושימוש שוטף בזמן אמת.', 'בקרה פנימית על הטמעות הקמפוס הדיגיטלי - באחריות נאמן הקמפוס  הדיגיטלי בגדוד או בענף לבצע בקרה שוטפת לאורך המחזור אודות ביצוע ההזנות הנדרשות ע"י הפלוגות תחתיו. באחריות מפקד הגפ"ה ביחידה לבצע אחת למחזור בקרה על הטמעת הקמפוס הדיגיטלי ביחידות.', 'ניהול המערכת - מעקב אחר משימות המשה"ד במהלך המחזור יתבצעו ע"י מנהלי המערכת באמצעות הפקת דוחות, ביקורות ופגישות באופן שבועי בנוסף על פיקוח של מפקד הפלוגה. טכנולוגיה במרחב הלמידה - בעת ביצוע מבחן בקמפוס יתבצע פיקוח מוגבר של אנשי הסגל לשם שמירת מהמינות המבחן.' ]],

        arrayTwo: [['פיתוח הכשרה חדשה מתבצע בדר”כ בעקבות שינויים בתו”ל, תפיסות ואמל”ח, אשר דורשים בעלי תפקידים חדשים שלא היו קיימים בעבר. ' + " " + "" + 'תהליך פיתוח הכשרה חדשה:    ' + "     " + "                  " + '   עיבוד ניתוח התפקיד, קביעת רציונל ההכשרה, ניתוח הכשירויות והמדדים לידע ומיומנויות נדרשות. הגדרת מצבי המבחן המסכם, הגדרת אופן הערכת המבחן, בניית מערכת שעות עקרונית להכשרה, הגדרת התשתיות והמשאבים הנדרשים להכשרה, הגדרת לו”זים ותחומי אחריות, מפקד צוות הפיתוח יגדיר את השלבים והלו”ז בתהליך הפיתוח     '], 
        ['תיק היסוד הינו המסמך מחייב לכל קורס או השתלמות ומתועדים בו מבנה הקורס והתנאים הנדרשים לקיומו, כתוצר של תהליך פיתוח הדרכתי. כתיבת תיק יסוד: יחידה המבצעת הכשרה, תכתוב את תיק היסוד בשיתוף עם הגורם החילי הרלוונטי,  יש לשלב בתהליך הכתיבה גורם מוסמך מטעם מחלקת האימונים.', 'אישור תיק יסוד: על כל חיל להגדיר גורם מטה חילי, האחראי על ניהול עבודת המטה הזרועית לאישור תיקי יסוד, כל תיק יסוד היוצא לסבב אישורים מטעם ביה”ס, יאושר ראשית ע”י: מפקד הגפייה, רע”ן או מג”ד ומפקד ביה”ס.', 'עדכון תיק יסוד: בטווח הזמן של חמש השנים בין אישורי תיקי היסוד, נדרש לתעד את כלל העדכונים החלים בהכשרה. בבהל״ג נעשתה עבודה מאסיבית של תיקוף תיקי היסוד.תיקי היסוד כעת נמצאים בתהליך אישור ע״י פיקוד ז״י.'], 
        ['מבחן הוא כלי המאפשר למפקדים להעריך את רמת הידע, ההבנה והכשירות של חניך במהלך ההכשרה. התארגנות טרם מבחן: טרם המבחן יש לפרסם לחניכים את  הנושאים עליהם הם עתידים להיבחן. במבחן מעשי נדרש לפרסם לחניכים את דף ההערכה טרם המבחן, יש לאפשר לחניכים זמן ללמידה עצמית טרם הבחינה. ', 'פיתוח המבחן: פיתוח המבחן ייעשה בהתאם לתורה המקצועית בנושא כתיבת מבחנים, לכל מבחן עיוני ייבנה טופס תשובות (תשובון), לכל מבחן מעשי ייבנה דף הערכה אשר יכלול את הקריטריונים להערכת הביצוע של הנבחן. ואת אופן חלוקת המשקלים הפנימית.', 'בדיקה ומישוב המבחן: בדיקה של המבחן תיעשה ביחס לדף התשובות המאושר, במבחן עיוני יש לפרסם את דף התשובות עם חלוקת הטפסים הבדוקים, במבחן מעשי, יש לבצע משוב פרונטלי/כתוב לכל נבחן ע"ב דף ההערכה, עד שבוע מיום הבחינה, יש לקיים שיחה אישית עם חניך הנכשל במבחן עיוני/מעשי, בה יוסברו לחניך נקודות הכשל והמשך תהליך הלמידה.', '*המבחנים העיוניים לא יעלו על 30% סך המבחנים המסמיכים בהכשרה. *לכל חניך יינתנו שני מועדים לביצוע המבחן - מועד א’ ומועד ב.'], 
        ['תיק הכולל את התוכן המקצועי והפעולות ההדרכתיות, המרכיבות שיעורפרונטלי או פעילות בעלת מרכיבים מעשיים. התיק נועד לאפשר הכנה מקצועית של המפקד או מדריך, להביא לאחידות מקצועית ולתרום לזיכרון הארגוני. כתיבה ותיקוף של תיק מדריך:  לכל יחידת לימוד יבוצעו תהליך פיתוח הדרכתי ע"פ התו"ל, לכל יחידת לימוד מסוג עיוני או מעשי ייכתב תיק מדריך, על כל יחידת לימוד יהיה חתום קצין בדרגת סגן לפחות.', 'כל תיק מדריך יכלול את הפרקים הבאים:  דף אישורים,  מבואות - דף מבוא למדריך הכולל את קהל היעד, מיקום השיעור ברצף ההכשרה, מידת קושי ודגשים למדריך,  תיק תוכן - הכולל העמקה מקצועית בתוכן הנלמד עבור המדריך, מערך שיעור - הכולל אתו רצף השיעור והנחיות למעביר השיעור,  מצגת לומדה, סרטון וכו.'],
        ['"פרויקט מפקדי חוליות" הוא פרויקט שמטרתו לאתר ולפתח חיילי הכשרה אשר ע"פ הקריטריונים הינם מתאימים להיות מפקדי חוליה כבר משלב הטירונות כחלק ממסגרת מבנה וארגון לקרב של חוליה לוחמת, תוך מתן דגש על פיקוד, הצבת סטנדרט גבוה וסיום ההכשרה בהצלחה.', 'מתווה בחירת מפקד חוליה: '  + '' + "" +  ' במהלך הגיוס - הפרויקט מאתר שלישותית חיילים אשר התגייסו בעלי מתאם קצונה 3-6. בנוסף, בשלב הראשוני של הגיוס בוחנים המפקדים את רמת המוטיבציה של החייל לשירות קרבי. חודש ראשון להכשרה: כש"ג - במהלך החודש הראשון להכשרה יבצעו כחלק מכלל המסגרת בוחן כש"ג ראשוני אשר יהווה גורם משפיע בהחלטת המפקדים. יכול להיות שהוא לא עבר אבל גם לא רחוק מלעבור.', 'חוו"ד מפקד: ' + '' + "" +  ' בתום החודש הראשון להכשרה יעביר המפקד הישיר (מ"כ/מ"מ) של החייל חוו"ד מפקד למ"פ הפלוגה על כל חייל אשר בפוטנציאל להיות מפקד חוליה. בהתאם לחוו"ד מפקד גבוה בהשתכלל כלל הנתונים שצוינו לעיל יוחלט אם החייל נמצא מתאים לפרויקט מפקדי חוליות.']],

        arrayThree: [['הגדרת תפקידים ברורה לסגלי ההדרכה תאפשר לכל בעל תפקיד למלא את תפקידו  תוך כדי הבנת תחומי אחריותו, ותוך תאום עם בעלי תפקידים אחרים. סגל מפקדים: מפקד הכיתה - אחראי לטיפול בפרט בקרב חניכיו. סמל- אחראי לכל צורכי הלוגיסטיקה בהדרכה. מפקד המחלקה- אחראי על תהליך בחירת המיצטיים בקרב החניכים.', 'מש”ק הדרכה פלוגתי- אחראי על ניהול הידע בפלוגה. מפקד הפלוגה- אחראי על פיתוח, חניכה והערכת המפקדים. מפקד הגדוד ומקביליו- אחראי על ביצוע אישורי תוכניות. סגל הדרכה מקצועי. מדריך- העברת שיעורים ותרגולים לחניכים. קצין מגמה- אחראי על תכנון וביצוע הכנות סגל למפקדים. רמ”ד- אחראי על סגל ההדרכה שבפיקודו.'],
        ['איכות ההכשרות והיכולת לעמוד במטרותיהן, תלויות באופן ישיר בסגל הפיקוד וההדרכה. תהליכי האיתור מאפשרים ליחידות להבטיח כי המפקדים המתאימים ביותר ישובצו כמפקדים בהכשרות. לכל הכשרה תהליך סדור, המורכב מאיתור של חניכים מומלצים ליציאה לפיקוד.', 'עקרונות: בא”ח- גיבוש פוטנציאל בהתאם לקריטריונים עד אמצע הטירונות. גדוד הפיקוד- גיבוש המלצה לשיבוץ בהכשרות ע”ב קריטריונים מוגדרים עד שבוע שבועיים מסיום ההכשרה.', 'שלב איתור הפוטנציאל: להלן קריטריונים לסימון פוטנציאל מאותרים להדרכה: בעל ידע מקצועי רב. בעל ראייה מערכתית. יכולת העברת מסרים. יכולות חניכה גבוהות. יכולות למידה עצמית. יכולת עבודה בצוות וקבלת ביקורת. יכולות הובלה ורתימה.'],
        ['לסגל ההדרכה חשיבות רבה בהצלחת ההכשרה. סגל ההדרכה נדרש לחולל את תהליך הלמידה בקרב ומכאן הצורך בקיום הכנות סגלים מקצועיות ואיכותיות. מטרות הכנת הסגל: א. להכשיר מפקדים חדשים למפקדי הכשרות - עמידה בקריטריונים של ‘כשיר להכשיר’. ב. להקנות לאיש הסגל את הידע והמהמיומנויות, לתפקידו בהכשרה. ג. ללכד את הסגל ולגבשו סביב מטרות ההכשרה.', 'הגדרות:  סגל הדרכה - כל בעל תפקיד המשתייך למסגרת המבצעת את ההדרכה בפועל. הכנת סגל - תהליך של בניית סגל כצוות עבודה. התוכנית להכנת סגל תיבנה ע”י, מפקד הפלוגה או מפקד הקורס בדרגת סגן לכל הפחות.', 'הכנת הסגל תבנה בחלוקה לארבעה צירים: הציר הפיקודי - תפיסת תפקיד המפקד בהכשרה, מדיניות ענישה ותפיסת המרחק הפיקודי, הרצאת קב”ן רופא ות”ש. הציר המקצועי- עדכוני תו”ל וסדנאות בטיחות. הציר ההדרכתי - למידת תכנים בתחום ההדרכה כגון מב”ב ותיק היסוד. ציר עבודת הסגל - כולל את שלבי ההיכרות, הצבת היעדים, תיאום ציפיות, ונורמות עבודה.', 'סיכום הכנת הסגל: לכל הכנת סגל יתבצע סיכום בראשות מפקד הפלוגה או מפקד ההכשרה.  כחלק מהסיכום יש לבצע תחקור והפקת לקחים בשיתוף כלל אנשי הסגל. במהלך ההכשרה יוקדש פרק לתחקור והפקות לקחים שבוצעה טרם המחזור ובמהלכה.'],
        ['הערכת איש הסגל היא תהליך שיטתי ומובן  המאורגן בתוכנית קבועה מראש. תהליך הערכת וחניכת איש סגל מתחילה מיום קליטתו כאיש סגל ועד לסיום תפקידו. להערכת איש הסגל מספר מטרות: א. הסמכה לתפקיד כאיש סגל בתום הכנת הסגל. ב. שמירת כשירותו של איש הסגל. ג. חניכת איש הסגל לצורך שיפור תפקודו.', 'עקרונות העבודה: כל איש סגל לרבות סגל הדרכה, יוערך באופן שיטתי וקבוע במהלך  תפקידו, עם תכנית החניכה של ההכשרה. תכנית החניכה מוצגת בשבוע הראשון להכנת הסגלים.חלק מכלי ההערכה יירשמו במהלך הכנת הסגל כתנאי לפתיתת מחזור  מופעי החניכה, יבוצעו עייפ עקרונות החניכה.', 'בחירת איש סגל מצטיין: א. אחת למחזור יבחרו מפקדים אשר בלטו אשר בלטו בשאיפתם למצוינות ההכשרה. ב. המפקדים המצטיינים יבחרו ע”י מפקד ההכשרה, מ”פ ומקבילו. ג. כחלק מהקריטריונים יש להביא בחשבון את הישיגו בתוכנית ההערכה. מטרת הנוהל: הגדרת תהליך הערכת הסגלים וחניכתם בהכשרות.'],
        ['על מנת לרכוש כלים למימוש אחריותם, מתבצעים בבית הספר להדרכה של זרוע היבשה, הכשרות מקצועיות לבעלי תפקידים רלוונטיים. ההכשרות נקשרות לידע ולכשירויות הרלוונטיות הנדרשות לכל אחד מבעלי התפקידים. הכשרות בבית הספר להדרכה עוסקות במספר תחומים מקצועיים: א. ידע תיאורטי בנושא למידה. ב. פיתוח הדרכה מיקרו ומאקרו. ג. תהליכי הדרכה בבית הספר. ד. הכרות עם התורות של ההדרכה הרלוונטיות. ה. חשיפה להתפתחות כלי ושיטות ההדרכה בצבא ומחוץ לצבא.', 'דגשים והנחיות: ההכשרה לתפקיד תבוצע עד שלושה חודשים מכניסת בעל התפקיד לתפקידו. באחריות מפקד גוף פיתוח ההדרכה בבית הספר לבצע מעקב אחר ביצוע ההכשרות כמפורט לעיל.'],
        ['הידע והניסיון שצוברים בעלי התפקידים במהלך הקדנציות הוא חיוני ומשמעותי לצורך קיום הכשרה אפקטיבית. מטרת הנוהל: להגדיר את מנגנוני כניסת וסיום התפקיד של מפקדים בכירים בדרג מ”פ ומעלה בהכשרות. הגדרות: מפקדים בכירים בהכשרות -  לרוב מפקדים מדרג המ”פ עד דרג המג”ד. כניסה לתפקיד - פרק הזמן המוגדר בו רוכש המפקד הנכנס ידע ומיומנויות הנדרשות למילוי תפקידו.', 'תדירות תחלופת מפקדים ומשך קדנציות: מפקדים בדרג מ"מ ומקביליו יבצעו תפקיד של 8 חודשים לכל הפחות שני מחזורי הכשרה. מפקדים בדרג ממ"ג יבצעו תפקיד של שמונה חודשים עד שנה, בהתאם לציר הפיתוח שנקבע ע"י החיל. רמ"ד מקצועות בענף תצ"מ יבצע תפקיד של שנתיים לכל הפחות. מפקדים בדרג המג"ד יבצעו תפקיד של     שנתיים לכל הפחות.', 'מסמך סיום התפקיד יכלול את הסעיפים הבאים:  עיקרי התמורות אשר חלו בהכשרה בתקופת תפקידו.  לקחים ותובנות. סוגיות מומלצות לקידום לטובת שיפור ההכשרה.', 'היערכות לכניסה לתפקיד: כל מפקד בכיר נכנס יקבל תיק נתונים שלושה שבועות טרם כניסתו לתפקיד. אחריות העברת התיק היא של המפקד היוצא אלא אם הוגדר אחרתע”י מפקד הבה”ד.'],
        ['התהליך יפרט את אופן סיום התפקיד של איש הסגל שאינו מתאים לתפקידו, בשל פערים משמעותיים בביצוע התפקיד או בשל אירוע חריג אחר.  סיבות להרחקת מפקד  בהכשרה: אירוע חריג- אירוע שאינו עומד בנורמות הערכיות המצופות בצה"ל. הרחקה מסיבות פיקודית כתוצאה מחוסר התאמה. הרחקה בעקבות פער מקצועי. הרחקה מסיבה משמעתית כתוצאה מעבירה צבאית, או מהתנהגות שאינה הולמת.  הרחקה מסיבה רפואית. הרחקה במקרבה של מקרה בפגיעה בנפש או אובדנות.', ' מרגע ההחלטה יש לוודא כי נלקח מאיש הסגל נשקו האישי עד שיוחלט אחרת. ניתן לאפשר לאיש הסגל להגיש ערעור שיעובר למפקד בית הספר עד 48 שעות מרגע קבלת ההחלטה. תהליך הרחקת איש סגל מתבצע לאחר תהליך הערכה מסודר, הבוחן רקע מקצועי ופיקודי.'],
        ['עולם ההכשרות והלמידה הוא עולם משתנה המושפע מגורמים רבים, ביניהם ההתפתחות הטכנולוגית, שינויים בתו”ל וכו’. פורום הדרכה בה”די נועד לקדם תהליכי הדרכה המושפעים מהשינויים לעיל ותכליתם היא שיפור וטיוב ההכשרות בבהייד. בכל בה”ד יתקיימו שני סוגים של פורומים, פורום בכיר- יתקיים כל תקה”ד. ופורום מורחב- יתקיים אחת לחציון.', 'נושאים בהם יעסקו הפורומים: הפקת לקחים רוחביים מתקופת הדרכה - אחת לחציון, הטמעת טכנולוגיות ותפיסות בהכשרות, פערים ומגמות בנורמות ובתהליכי ההדרכה כתוצאה ממופעי בקרה פנימיים, שיטות למידה חדשניות, הצגת תהליך שבוצע באחת ההכשרות בעל פוטנציאל ליישום רוחבי, עדכוני תו”ל ואמל”ח בעלי משמעויות רוחביות להכשרות, הצגת מוקדי תחקיר בנושאים הרלוונטיים לאיכות ההכשרות, הצגת תחקירים מבצעיים בעלי השפעה על ההכשרות, כל נושא אחר בעל השלכות על כלל הפעילות ההדרכתית בבה”ד.'],
        ['שיחות מפקד בהל״ג הינן בגדר תוכן חובה הן בהכנות הסגלים והן בהכשרות לקצונה. האחרויות לתיכנון השיחות הן של מפקד המסגרת המכשירה או של הגורם המתאם. עיתוי השיחות: העמקה חיילית לקמ״פ - שיחת ׳צידה לדרך׳ למ״פ תתואם ליום האחרון או ליום לפני אחרון ההשתלמות.  שבוע המ״פ בהכשרה - שיחת ׳תפיסת תפקיד המ״פ׳ תתואם במהלך השבוע הראשון.', ' השתלמות מ״פים נכנסים - שיחת ׳המ״פ בהכשרה׳, תתואם כשיחה הראשונה של ההשתלמות. שיחות מפקד להכנות הסגלים, תתואם בדר״כ לשבוע האחרון בהכנות הסגלים בקורסי הפיקוד והשלמות הקצונה ובתחילת הכנת הסגל של הבא״ח. שיחות מפקד להשלמות הקצונה - שיחת ׳צידה לדרך׳ למ״מ, תתואם לשבועיים האחרונים של ההכשרות, טרם מופע סיכום הצוערים.'],
        ['מסלולי קידום מוגדרים לאנשי סגל ההדרכה מהווים חשיבות רבה בשתי רמות: ברמת בית הספר: מסלולי קידום מוגדרים וברורים תורמים למיצוי הפוטנציאל של סגלי ההדרכה. ברמת סגל ההדרכה:  מסלולי קידום מוגדרים וברורים יוצרים לסגלי ההדרכה אופק מקצועי ברור, וכן הגברה בניעה להדרכה והמשך צבאי.', 'התנאים של מדריכים בתחומים ייעודיים להתקדמות במסלולי הקידום, יוגדרו על פי המרכיבים הבאים: מוטיבציית החייל לתפקיד. חוו”ד מפקדים. עמידה בכשירות.', 'קידומי סגלי ההדרכה בבהל”ג: ביצוע תפקיד מ”כ, ביצוע תפקידי סמל/ רס”פ/ משה”ד/ פיתוח לקצונה, סמ”פ, יציאה לקמ”פ, מ”פ, מסלולים נוספים בהחלטת החיל.']],


        arrayFour: [['מטרת הנוהל היא להנחות את סגלי הפיקוד וההדרכה על אופן התמודדות עם חניכים מתקשים. הגדרות: חניך מתקשה - חניך שאינו עומד בתנאי הסף להכשרה או חניך שאותר ע”י סגל ההכשרה כמתקשה. לקות למידה - קושי ברכישת מיומנויות למידה על רקע נירולוגי. אבחונים דידקטיים/פסיכו-דידקטיים  - אבחון לאיתור לקויות המבוצע ע”י בעל מקצוע מוסמך.', 'חייל יכול להתקשות בתחומים הבאים: שפה, כושר, קליעה, תוכן מקצועי או בכל תחום אחר שבו ההכשרה נוגעת. דרכי הפעולה לקידום החניך: שעות תגבור, זמנים ללמידה עצמית, מועדי מבחנים חוזרים, התנסויות, והצמדת חונך מקצועי'],
        ['מופע המתקיים כאשר יש ספק לגבי ההתאמה של החניך לתפקידו. בתום הוודעה יחליטו אם החניך יודח מהתפקיד או יושאר בהכשרה. בשל הרגישות הרבה, נדרש להקפיד על תהליך סדור, הוגן והדרגתי מול החניך.', 'עילות להעלאת חניך לוועדת הערכה: הפסד ימי הכשרה ע”פ המוגדר בתיק יסוד, אירוע ערכי/ נורמטיבי/ משמעתי, אי עמידה בציוני הסף.', 'יש לשקף לחניך את תוצאות הוועדה בצורה ברורה ולוודא כי הוא הבין את המעשה ומדוע ההחלטה התקבלה.'],
        ['תהליך בחירת חניך מצטיין וחניך למופת מעודדת מצוינות ומאפשרת להדגיש את ההתנהגות וההישגים הרצויים בהכשרה. תהליך בחירת חניך מצטיין וחניך למופת נועד להגביר את הרצון להשקיע בהכשרה ולתגמל חניכים שהשקיעו בהכשרה ושהגיעו להישגים שבולטים לטובה.', 'התבחינים להצטיינות למופת יתייחסו למרכיבים האלה: חיילות והתנהגות ערכית,  הישגים לימודיים,  התנהגות ראויה לציון לשבח: למשל סיוע לחברי הקורס, יוזמה, התנדבות, ללא עבירות משמעת.'],
        ['תיק אישי לחניך משמש אמצעי לאיסוף המידע וריכוזו במכלול נושאים בעלי רלוונטיות לחניכים בקורס. הוא מהווה מעקב מסודר ושיטתי ומאפשר איתור מוקדם של בעיות לימודיות, חברתיות ואישיות.', 'מידע המנוהל בתיק אישי: סיכום דף קליטה לקורס הכולל נתוני רקע על החניך. סטאטוס ביצוע לרבות ציוני מבחנים של תנאי הסף להסמכה. משובי התנסויות ותרגילים. תוכנית החניכה והתיעוד שלה. אירועים אישיים חריגים לרבות - (תוכנית חניך מתקשה, ועדות הערכה, סיכום תחקירים שהחניך היה חלק מהם - אירועי משמעת, אירועי בטיחות). אירועי פרט: ת”ש, קב”ן, רפואי - אין צורך לתעד טפסים מקוריים אלא לציין זאת בסיכומי ראיונות.'],
        ['המעבר מההכשרה ליחידה הקולטת הוא בעל חשיבות רבה להמשך שירותו של החייל ומיצוי הפוטנציאל שלו ביחידה הבאה. ניתן להפיק את דוח העברת המקל ממערכת הקמפוס הדיגיטלי.', 'דוח העברת מקל, על דוח העברת המקל לפרט את המידע הבא: פרטים אישיים - מקום מגורים, מצב משפחתי. מידע מקצועי - פירוט הישגים בהכשרה, נקודות חוזק מקצועיות ונקודות חולשה, אשר נדרש להמשיך לבחון את רמת כשירותו של החייל. מידע אודות נורמות וערכים - רמת ההסתגלות של החייל, אירועים חריגים במהלך ההכשרה והמלצות להמשך מוקדי חניכה. מידע נוסף - סוגיות ת”ש, רפואה, או כל נושא אחר המחייב תשומת לב מפקדים והמשך טיפול.']],
        arrayFive: [['ההדרכה על אמל”ח ביבשה עוברת בשנים האחרונות תהליך שינוי במסגרתו הלמידה מתבצעת יותר על אמצעים מדמים ופחות על האמל”ח בפועל. השינוי נובע הן משיקולי  התייעלות והן מההתפחות הטכנולוגית המאפשרת דימוי איכותי ויכולות תחקור מתקדמות.', 'תהליך הקליטה של המאמן יובל ע”י רע”ן תצ”מ ורמ”ד המקצועות בשיתוף מטה ביה”ס. יש להוציא כתב מינוי בחתימת מפקד הבה”ד, לקליטת המאמן והפונקציות המוגדרות בתהליך. תהליך הקליטה יבוצע לאחר למידה ובדיקה מעמיקה של המאמן בתעשייה המפתחת.'],
        ['בצה”ל קיים נוהל המגדיר תהליך ייזום של התוויה וקליטה של אמל”ח חדש. הוראת ה’קליטה האג”מית נכתבת ע”י החיל ומופצת כפקודה לבית הספר כחצי שנה טרם תחילת ההכשרה בהכשרות. יש להגדיר את הכשירות והמדדים של הפעלת האמל”ח לכל אחד מבעלי התפקידים הנחשפים אליו.', 'על וועדת הקליטה לנהל גאנט הכולל את הנושאים הבאים: מעקב אחר הגעת האמצעים להדרכה, מעקב אחר פיתוח תכולות ההדרכה, מעקב אחר הכנת הסגלים, מעקב אחר עדכון תיקי היסוד הרלוונטים.'],
        ['תשתיות ההדרכה מהוות נדבך מרכזי ביכולת להוציא לפועל את תכניות ההכשרה השונות ביחידות זרוע היבשה. ע”מ לשמר את תשתיות ההדרכה, יש לקיים מנגנון סדור לאחזקתן. תשתיות הדרכה- כל מבנה שמטרתו לקיים באמצעותו למידה או אימון לרבות כיתות מסוגים שונים, טווחים, לש”ביות ומאמנים.', 'בע”ת האחראים על אחזקת הכיתות. האחריות הכוללת על אחזקת תשתיות ההדרכה, היא אחריות אג”מ בהל”ג. סגן מפקד היחידה ומטה.  ביה”ס יכינו רשימה של כלל תשתיות ההדרכה בבה”ד והקצינים הממונים על כל תשתית. לדוגמא: קשר”ח- על מחשבים ומקרנים, ק. בינוי על חלונות וסורגים, וכו’.']],
        choosen: this.subNumber,
        i: this.innerPart,
        j: 0

    }
  },
  methods: {
    startPage() {
        this.$emit("curr-page", 2);
    },
    myButtons() {
        if(event.target.id === "back_button"){
            if(this.j > 0){
                document.getElementById("next_button").style.display="block";
                this.j = this.j - 1;
            }
        }else if(event.target.id === "next_button"){
            if(this.choosen === 0){
                if(this.arrayOne[this.i][this.j+1] === undefined){
                    document.getElementById("next_button").style.display="none";
                     document.getElementById("next_chapter").style.display="block";
                   this.j = this.j ;
                }else {
                   this.j = this.j + 1;
                }
            }else if(this.choosen === 1){
                if(this.arrayTwo[this.i][this.j+1] === undefined){
                    document.getElementById("next_button").style.display="none";
                     document.getElementById("next_chapter").style.display="block";
                   this.j = this.j ;
                }else {
                   this.j = this.j + 1;
                }
            }else if(this.choosen === 2){
                if(this.arrayThree[this.i][this.j+1] === undefined){
                    document.getElementById("next_button").style.display="none";
                     document.getElementById("next_chapter").style.display="block";
                   this.j = this.j ;
                }else {
                   this.j = this.j + 1;
                }

            }else if(this.choosen === 3){
                if(this.arrayFour[this.i][this.j+1] === undefined){
                    document.getElementById("next_button").style.display="none";
                     document.getElementById("next_chapter").style.display="block";
                   this.j = this.j ;
                }else {
                   this.j = this.j + 1;
                }
            }else {
                if(this.arrayFive[this.i][this.j+1] === undefined){
                    document.getElementById("next_button").style.display="none";
                     document.getElementById("next_chapter").style.display="block";
                    this.j = this.j ;
                }else {
                    this.j = this.j + 1;
                }
            }
        }
    },
    nextChapter(){
        this.$emit('make-progress', this.i);
        this.i = this.i + 1;
        this.j = 0;
        document.getElementById("next_button").style.display="block";
        document.getElementById("next_chapter").style.display="none";
    }
  },
}
</script>


<style>
#main_text {
    background-image: url("../assets/symbols/TextBackground.svg");
    background-size: cover;
    background-repeat: no-repeat;
    visibility: visible;
}
@font-face {
    font-family: MyFont;
    src: url("../assets/fonts/IBMPlexSansHebrew-Regular.ttf");
}

#study {
    width: 100%;
    height: 100%; 
    cursor: pointer;
}


#real_study_text {
    color: white;
    direction: rtl;
    position: absolute;
    font-family: MyFont;
    font-weight: 700vw;
    font-size: 4.3vw;
    right: 2%;
    width: 95%;
    height: 75%;
    line-height: 2;
    margin-top: 15%;
}


#back_button {
    position: absolute;
    background-image: url("../assets/symbols/BackwardsButton.svg");
    background-size: contain;
    background-repeat: no-repeat;
    width: 15%;
    height: 10%;
    bottom: 0%;
    right: 2%;

}

#next_button {
    position: absolute;
    background-image: url("../assets/symbols/NextButton.svg");
    background-size: contain;
    background-repeat: no-repeat;
    width: 15%;
    height: 10%;
     bottom: 0%;
     left: 2%;
}

#next_chapter{
     position: absolute;
   width: 15%;
    height: 10%;
     bottom: 0%;
     left: 2%;
     cursor: pointer;
     display: none;
     border: 3px solid pink;
     background-color: pink;
}

#inner_title{
    position: absolute;
    height: 10%;
    width: 100%;
    color: white;
    font-family: MyFont;
    direction: rtl;
}
</style>